NikolayBobovnikov/ircapture/auvir_embed/cubemx/stm32f103c8t6/Src/main.c
}
void send_data_frame()
{
    // disable_tim_interrupts
    __HAL_TIM_DISABLE_IT(&htim3, TIM_IT_CC1);

    generate_binary_for_ir_frame();
    convert_ir_frame_to_manchester_format();

    // enable_tim_interrupts
    __HAL_TIM_ENABLE_IT(&htim3, TIM_IT_CC1);
}
void send_protocol_frame()
{
    ///generate_binary_for_ir_frame();
    ///transform_binary_from_msb_to_lsb();
    ///convert_binary_to_pwm_format();

    // TODO: get total bit number
    do
    {
        // k-th bit of n: (n >> k) & 1
        tx_bit = (tx_data >> tx_current_bit_position) & 1;
        if(tx_bit == 1)
        {
            force_envelop_timer_output_on();

        }
        else // bit == 0
        {
            force_envelop_timer_output_off();

        }

        tx_current_bit_position++;
    } while (tx_current_bit_position < tx_total_bits);

}
void transmit_handler()
{
    /* Send data frame
     * 1. start sequence
     * 2. data
     *  2.1 Coded angle
     *  2.2 Time of emission
     *  2.3 Beamer ID
     * 3. data redundancy (repeated, or use error correction code)
     * 4. stop sequence
     */
    // htim3 forming envelop
    // htim2 generates PWM

    switch(TransmitterState)
    {
        case TX_WAITING_FOR_TRANSMISSION:
        {
            nop();
            break;
        }
        case TX_SENDING_START_BIT:
        {
            htim3.Instance->ARR = PeriodOfStartStopBits;

            // Start sequence consists of signal sequence {1,0,1}
            switch(StartStopSequenceTransmitState)
            {
                    // High
                case STAGE_0:
                {
                    StartStopSequenceTransmitState = STAGE_ON1;
                    force_envelop_timer_output_on();
                    break;
                }
                    // Low
                case STAGE_ON1:
                {
                    StartStopSequenceTransmitState = STAGE_OFF;
                    //force_envelop_timer_output_off(); done anyway in timer interrupt handler
                    break;
                }
                    // High
                case STAGE_OFF:
                {
                    StartStopSequenceTransmitState = STAGE_ON2;
                    force_envelop_timer_output_on();
                    break;
                }
                   // Low
                case STAGE_ON2:
                {
                    StartStopSequenceTransmitState = STAGE_0;
                    TransmitterState = TX_SENDING_DATA;
                    break;
                }
            }
            break;
        } 
        case TX_SENDING_DATA:
        {
            htim3.Instance->ARR = PeriodOfDataBits;

            // send current bit of data
            if(tx_current_bit_position < tx_total_bits)  // change to next state
            {
                // k-th bit of n: (n >> k) & 1
                tx_bit = (tx_data >> tx_current_bit_position) & 1;
                if(tx_bit == 1)
                {
                    force_envelop_timer_output_on();
                }
                else // bit == 0
                {
                    force_envelop_timer_output_off();
                }
                tx_current_bit_position++;
            }
            // TODO: check nessesity of condition below
            else  // change to next state
            {
                tx_current_bit_position = 0;

                //TransmitterState = TX_DATA_SENT;
                TransmitterState = TX_SENDING_STOP_BIT;

                /* Set the Autoreload value for start sequence bits*/
                htim3.Instance->ARR = PeriodOfStartStopBits;
            }
            // TODO: check if some errors or other options are possible here?
            break;
        }
        case TX_SENDING_STOP_BIT:
        {
            // TODO: check if worth to move ARR update to step abore

            // Start sequence consists of signal sequence {1,0,1}
            switch(StartStopSequenceTransmitState)
            {
                case STAGE_0:
                {
                    StartStopSequenceTransmitState = STAGE_ON1;
                    force_envelop_timer_output_on();
                    break;
                }
                case STAGE_ON1:
                {
                    StartStopSequenceTransmitState = STAGE_OFF;
                    force_envelop_timer_output_off();
                    break;
                }
                case STAGE_OFF:
                {
                    StartStopSequenceTransmitState = STAGE_ON2;
                    force_envelop_timer_output_on();
                    break;
                }

                // transitional state
                // TODO: check if possible to move to beginning of next state (thus remove delay)
                case STAGE_ON2:
                {
                    htim3.Instance->ARR = PeriodBetweenDataFrames;
                    StartStopSequenceTransmitState = STAGE_0;
                    TransmitterState = TX_DELAY;
                    break;
                }
            }
            break;
        }
        case TX_DELAY:
        {
            htim3.Instance->ARR = PeriodOfStartStopBits;
            StartStopSequenceTransmitState = STAGE_0;
            TransmitterState = TX_WAITING_FOR_TRANSMISSION;

            break;
        }
    } // switch(TransmitterState)
}
void receive_handler()
{
    /* Receive data frame
     * 1. start sequence
     * 2. data
     *  2.1 Coded angle
     *  2.2 Time of emission
     *  2.3 Beamer ID
     * 3. data redundancy (repeated, or use error correction code)
     * 4. stop sequence
     *
     * Check data integrity. If OK, data is received
     */

    /* 1. Waiting for start bit
     * 2. Input capture channel: rising edge detected. Start timer, wait 1/2 of period
     * 3. 1/2 period check: if signal is high, start bit is received, goto 4, otherwise stop timer, goto 1
     * 4. 1/2 + i period check: read timer signal, increment received bits count
     * 5. If rbc == total_bits, wait for stop bit
     * 6. Check stop bit: if signal is high, stop timer, save received data, update event (?), goto 1
     *
     */
    switch(ReceiverState)
    {
        case RX_WAITING_FOR_START_BIT:
        {
            if(__HAL_TIM_GET_FLAG(&htim4, TIM_FLAG_CC1) != RESET)
            {
              if(__HAL_TIM_GET_IT_SOURCE(&htim4, TIM_IT_CC1) !=RESET)
              {
                  htim4.Instance->ARR = HalfPeriodOfStartStopBits;
                  ReceiverState = RX_START_BIT_SENDING;
                  StartStopSequenceReceiveState = STAGE_0;
                  // wait for half a period of startstop bit sequence
              }
            }
            break;
        }
        case RX_START_BIT_SENDING:
        {
            // Start sequence consists of signal sequence {1,0,1}
            switch(StartStopSequenceReceiveState)
            {
                //High confirmed: STAGE_0 -> STAGE_ON1
                case STAGE_0:
                {
                    // Timer4 Input Channel 1 mapped to PB6

                    if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_6) == GPIO_PIN_SET) //high level is confirmed, continue reading start sequence
                    {
                        htim4.Instance->ARR = PeriodOfStartStopBits;
                        StartStopSequenceTransmitState = STAGE_ON1;
                    }
                    else  // in the start sequence current level should be high, reset the state
                    {
                        ReceiverState = RX_WAITING_FOR_START_BIT;
                        StartStopSequenceReceiveState = STAGE_0;
                    }
                    break;
                }
                    //Low: STAGE_ON1 -> STAGE_OFF
                case STAGE_ON1:
                {
                    if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_6) == GPIO_PIN_RESET) //current level is low, continue reading start sequence
                    {
                        StartStopSequenceTransmitState = STAGE_OFF;
                    }
                    else // in the start sequence current level should be low, reset the state
                    {
                        ReceiverState = RX_WAITING_FOR_START_BIT;
                        StartStopSequenceReceiveState = STAGE_0;
                    }
                    break;
                }
                    //High: STAGE_OFF -> STAGE_ON2
                case STAGE_OFF:
                {
                    //if current level is high, reading start sequence is done
                    if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_6) == GPIO_PIN_SET)
                    {
                        // what remains now before data is HalfPeriodOfStartStopBits ticks of high level,
                        // then PeriodOfStartStopBits ticks of low level

                        StartStopSequenceTransmitState = STAGE_ON2;
                    }
                    else // in the start sequence current level should be high, reset the state
                    {
                        ReceiverState = RX_WAITING_FOR_START_BIT;
                        StartStopSequenceReceiveState = STAGE_0;
                    }
                    break;
                }
                // transitional state
                // TODO: check if possible to move to beginning of next state (thus remove delay)
                case STAGE_ON2:
                {
                    // final "delay" before data
                    if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_6) == GPIO_PIN_RESET)
                    {
                        // from now on, data will come after HalfPeriodOfStartStopBits ticks
                        //htim4.Instance->ARR = HalfPeriodOfStartStopBits;

                        //TODO: check that current level is low?
                        //reset StartStopSequenceState
                        StartStopSequenceTransmitState = STAGE_0;
                        // move on to the next receiver state
                        //ReceiverState = RX_START_BIT_SENT;
                        ReceiverState = RX_DATA_RECEIVING;
                    }
                    else
                    {
                        ReceiverState = RX_WAITING_FOR_START_BIT;
                        StartStopSequenceReceiveState = STAGE_0;
                    }
                    break;
                }

