NikolayBobovnikov/ircapture/auvir_embed/cubemx/stm32f103c8t6/Src/main.c
            }
            break;
        }
        // Transitiolal state, adjust timer period so that we start readind data bits in the middle of each signal
        case RX_START_BIT_SENT:
        {
            // start reading data bits after HalfPeriodOfDataBits
            htim4.Instance->ARR = HalfPeriodOfDataBits;
            ReceiverState = RX_DATA_RECEIVING;
            // initialize buffer with all zeros
            rx_data = 0;
            break;
        }

        case RX_DATA_RECEIVING:
        {
            //now reading data bits with period of PeriodOfDataBits ticks
            htim4.Instance->ARR = PeriodOfDataBits;
            // send current bit of data
            if(rx_current_bit_position < rx_total_bits)  // change to next state
            {
                // k-th bit of n: (n >> k) & 1
                if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_6) == GPIO_PIN_SET)
                {
                    // set bit at the inversed position
                    rx_data |= 1 << (rx_total_bits - rx_current_bit_position -1);
                }
                /*
                 * below is redundant since all rx_data bits are initialized to zeros
                else
                {
                    //rx_bit = 0;
                    rx_data |= 0 << rx_current_bit_position;
                }
                */
                rx_current_bit_position++;
            }
            else
            {
                rx_data;// received data is here
                rx_current_bit_position = 0;
                ReceiverState = RX_DATA_RECEIVED;
                // wait remaining HalfPeriodOfDataBits before [the delay before] stop bit sequence
                htim3.Instance->ARR = HalfPeriodOfDataBits;
            }

            break;
        }
        case RX_DATA_RECEIVED:
        {
            TransmitterState = RX_STOP_BIT_RECEIVING;
            // wait half of the delay before stop bit sequence
            htim3.Instance->ARR = HalfPeriodOfStartStopBits;
            break;
        }
        case RX_STOP_BIT_RECEIVING:
        {
            switch (StartStopSequenceReceiveState)
            {
                case STAGE_0:
                {
                    // we are in the middle of delay before stop bit sequence, line should be low
                    if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_6) == GPIO_PIN_RESET)
                    {
                        // continue reading stop bit sequence with PeriodOfStartStopBits interval
                        htim3.Instance->ARR = PeriodOfStartStopBits;
                        StartStopSequenceReceiveState = STAGE_ON1;
                    }
                    else
                    {
                        ReceiverState = RX_WAITING_FOR_START_BIT;
                        StartStopSequenceReceiveState = STAGE_0;
                    }
                    break;
                }
                case STAGE_ON1:
                {
                    // we are in the place of first bit of stop sequence, line should be high
                    if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_6) == GPIO_PIN_SET)
                    {
                        StartStopSequenceReceiveState = STAGE_OFF;
                    }
                    else
                    {
                        ReceiverState = RX_WAITING_FOR_START_BIT;
                        StartStopSequenceReceiveState = STAGE_0;
                    }
                    break;
                }
                case STAGE_OFF:
                {
                    // we are in the place of delay between 2 bits of stop sequence, line should be low
                    if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_6) == GPIO_PIN_RESET)
                    {
                        StartStopSequenceReceiveState = STAGE_ON2;
                    }
                    else
                    {
                        ReceiverState = RX_WAITING_FOR_START_BIT;
                        StartStopSequenceReceiveState = STAGE_0;
                    }
                    break;
                }
                case STAGE_ON2:
                {
                    // we are in the place of 2 bit of stop sequence, line should be high
                    if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_6) == GPIO_PIN_SET)
                    {
                        StartStopSequenceReceiveState = STAGE_0;
                        ReceiverState = RX_STOP_BIT_RECEIVED;
                    }
                    else
                    {
                        ReceiverState = RX_WAITING_FOR_START_BIT;
                        StartStopSequenceReceiveState = STAGE_0;
                    }
                    break;
                }
            }

            break;
        }
        case RX_STOP_BIT_RECEIVED:
        {
            // immediately after stop sequence, line should be low
            if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_6) == GPIO_PIN_RESET)
            {
                // we successfully received data, send corresponding event for listeners to read from the data buffer
                // TODO
                rx_data;
            }
            else
            {
                ReceiverState = RX_WAITING_FOR_START_BIT;
                StartStopSequenceReceiveState = STAGE_0;
                // TODO: check necessity
                //htim4.Instance->ARR = HalfPeriodOfStartStopBits;
            }
            break;
        }
    } // switch(ReceiverState)
}

void generate_binary_for_ir_frame(){}
void convert_ir_frame_to_manchester_format(){}
void transform_binary_from_msb_to_lsb(){}
void convert_binary_to_pwm_format(){}


void force_envelop_timer_output_on()
{
    HAL_TIM_PWM_Start_IT(&htim2, TIM_CHANNEL_2); // carrier
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_2, GPIO_PIN_SET);
}
void force_envelop_timer_output_off()
{
    HAL_TIM_PWM_Stop_IT(&htim2, TIM_CHANNEL_2); // carrier
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_2, GPIO_PIN_RESET);
}
void send_start_stop_sequence()
{

}
void nop(){}
/* USER CODE END 4 */

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
